Revit 2026 API

# UpdaterData Properties

---

The UpdaterData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

UpdaterData Class

Autodesk.Revit.DB Namespace